** 伪终端 tty, pty, pts
- tty 是 teletypes 或者 teletypewriters 的缩写, 原指通过串行线用打印机键盘阅读和
  发送消息的东西, 后来被键盘和显示器取代.
- pty 是 pseudo-tty 的缩写, 即远程登录时产生的虚拟终端.
- pts (pseudo-terminal slave) 是 pty 的实现方法, 与 ptmx(pseudo-terminal master)
  配合使用实现 pty.
 
#+begin_src sh :results raw
ls -la /dev/tty /dev/tty1 /dev/tty63 /dev/ttyS0 /dev/ttyS3
ls -la /dev/pts/
#+end_src

#+RESULTS:
crw-rw-rw- 1 root tty     5,  0 Sep  8 01:06 /dev/tty
crw--w---- 1 root tty     4,  1 Sep  7 06:11 /dev/tty1
crw--w---- 1 root tty     4, 63 Sep  7 06:11 /dev/tty63
crw-rw---- 1 root dialout 4, 64 Sep  7 06:11 /dev/ttyS0
crw-rw---- 1 root dialout 4, 67 Sep  7 06:11 /dev/ttyS3
total 0
drwxr-xr-x  2 root root    0 Sep  7 06:11 .
drwxr-xr-x 17 root root 4100 Sep  7 06:11 ..
c---------  1 root root 5, 2 Sep  7 06:11 ptmx

可以看到 linux 中的终端分为以下几种:
- 串行终端 (/dev/ttySX) : 设备号分别为 (4,0), (4,1).., 对应 DOS 下的 COM1, COM2.
可以 echo 数据, 可以接串口来实验.
- 控制终端 (/dev/tty) : 当前进程的控制终端, 设备号为 (5,0), 使用命令 tty 可以查
看它实际对应的设备. /dev/tty 有点个像是到实际终端的一个链接.
- 控制台终端 (/dev/ttyX, /dev/console) : /dev/tty0 为当前控制台终端 /dev/ttyX 的
别名, 系统所产生的信息会发送到 /dev/tty0.
- 虚拟终端 (/dev/pts/X) : 在 XWindows 模式下的伪终端, telnet 或 ssh 等方式登录时
亦使用 pts (通过 getty). 例如: telnet->pts->ptms->getty.

当 /dev/fd* (Framebuffer) 设备没有启用时, 可以通过 /dev/tty0 访问显卡.

